import random

from aiogram import Router
from aiogram.filters import Command
from aiogram.types import Message
from keyboards.markups import kb_menu

router = Router(name=__name__)

@router.message(Command("Gust"))
async def command_menu_handler(message: Message):
    await message.answer("Choose a number:", reply_markup=kb_menu)
    


async def school():
    school = [' Визначте час для вивчення кожного предмета та виконання домашніх завдань. Це допоможе вам бути організованим та встигати все.',
              'Ведіть зошит з нотатками під час уроків. Це допоможе краще засвоювати матеріал та підготуватися до контрольних робіт.',
              'Постійно працюйте над власним розвитком, вдосконалюйте свої навички та намагайтеся краще розуміти вивчений матеріал.',
              'Не соромтеся задавати питання вчителям, це допоможе вам краще зрозуміти матеріал і підготуватися до уроків.',
              'Важливо робити короткі перерви під час вивчення, щоб не перенапружувати мозок і покращити концентрацію.',
              'Важливо знаходити час для відпочинку та розваг, щоб підтримувати емоційний стан та уникнути вигорання.',
              'Розподіліть завдання на менші частини і плануйте їх виконання на кожен день. Це допоможе уникнути стресу і покращити продуктивність.',
              'Ведіть список домашніх завдань і відзначайте їх, коли вони виконані. Це допоможе вам контролювати свої обовязки і не забувати про них.',
              'Перед кожним уроком перегляньте матеріал, що буде вивчатися, це допоможе вам краще зрозуміти тему і бути готовим до уроку.',
              'Записуйте свої досягнення і успіхи в навчанні. Це допоможе вам бачити свій прогрес і мотивувати себе до подальших досягнень',
              'Під час навчання важливо робити короткі перерви, щоб відпочити і підтримувати концентрацію.',
              'Регулярно повторюйте вивчений матеріал, щоб закріп',
              'Важливо дотримуватися здорового режиму дня, спати достатньо годин і харчуватися здоровою їжею, щоб мати енергію для навчання.',
              'Ставте перед собою цілі і мотивуйте себе до досягнення найкращих результатів у навчанні.',
              'Розгляньте можливість взяти участь у додаткових заняттях або курсах, щоб поглибити свої знання з певних предметів.']
    random_school = random.choice(school)
    await Message.answer(random_school)
    
    # print(random_school)

#Прогулянка 
Nature = ['Спробуйте вибрати один і той самий час на прогулянки кожен день. Це допоможе вам встановити регулярну рутину і вбудувати прогулянки у свій розклад.',
          'Вибирайте різноманітні маршрути для прогулянок, щоб додати цікавості та рознообразити ваші прогулянки.',
          'Встановлення конкретної мети для прогулянок (наприклад, кількість кроків, час тривалості) може бути мотивуючим та допоможе досягти певних цілей фізичної активності.',
          'Слухайте цікаві аудіоподкасти або аудіокниги під час прогулянок, щоб зробити їх більш насиченими та корисними.',
          'Ведіть журнал або використовуйте додатки для відстеження прогулянок, щоб бачити свій прогрес та мотивувати себе.',
          'Запрошуйте когось із рідних або друзів на прогулянку. Це не лише підніме ваш настрій, але й зробить прогулянку більш соціальною та цікавою.',
          'Спробуйте відвідати різні місця в вашому районі або в місті, щоб відкрити для себе нові місця та збагатити ваші прогулянки новими враженнями.',
          'Спробуйте приділити увагу деталям під час прогулянки - запахам, звукам, відчуттям повітря. Це може допомогти заспокоїти розум та зменшити стрес.',
          'Оберіть комфортний одяг і взуття для прогулянок в залежності від погодних умов, щоб зробити прогулянку приємною та комфортною.']
random_Nature = random.choice(Nature)
print(random_Nature)

#Спорт 
Sport = ['Вивчайте нові аспекти вашого спорту, вдосконалюйте техніку або дізнавайтеся про корисні тренування. Це допоможе підтримувати зацікавленість і розвивати навички.',
         'Знайти друзів або партнерів для спорту може зробити тренування цікавішим і мотивувати вас до регулярних занять.',
         'Важливо памятати, що спорт - це не лише для покарання себе, а й для задоволення. Спробуйте бачити позитивні результати вашої роботи над собою.',
         'Відповідне харчування є важливою частиною здорового способу життя та успішного заняття спортом. Спробуйте включати більше фруктів, овочів та білкових продуктів у свій раціон.',
         'Дайте своєму тілу відпочинок між тренуваннями. Недостатній сон та перевтома можуть вплинути на вашу продуктивність та мотивацію.',
         'Практика робить майстра. Навіть короткі, але регулярні тренування можуть принести більше користі, ніж великі, але рідкісні зусилля.']
random_Sport = random.choice(Sport)
print(random_Sport)
